Revit 2024 API
AreaBasedLoadData.PhasesNumber Property
 The Phases Number of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public int PhasesNumber { get; }
Visual Basic
Public ReadOnly Property PhasesNumber As Integer
	Get
Visual C++
public:
property int PhasesNumber {
	int get ();
}
Remarks
 This property is used to retrieve the Phases Number.
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace